{"url": "http://100parts.wordpress.com/2012/08/04/astray-baden-baden-day-31/", "timestamp": "2013-05-18T10:42:00", "dump": "CC-MAIN-2013-20", "segment": "1368696382261", "image_urls": [], "text": "these birches can be found in many places in Europe - the photos is from a short trip to Baden-Baden in 2007. the clouds in the background are the messengers of the storm Kyrill. here are some more moments of the trip: Baden-Baden.\n-\n“ast/ray” is a bilingual wordplay: “ast” means “twig” in German. and while “Baden-Baden” sounds like wordplay, too, it is the actual name of a rather well-know spa town that also dates back to Roman times. “Bad” is the German word for “bath”.\nMirror effect turned out nice. I like"}
{"url": "http://100percentwinnersblog.com/watch-survivor-redemption-island-season-22-episode-11-a-mystery-package-online-s22e11-free-stream-megavideo/", "timestamp": "2013-05-18T11:02:03", "dump": "CC-MAIN-2013-20", "segment": "1368696382261", "image_urls": [], "text": "Watch Survivor Redemption Island Season 22 Episode 11: A Mystery Package Online S22e11 Free Stream Megavideo\nArticle by StreamThatSeries\nHorray!time for another dose of very exciting reality series with lots of twists.You must watch survivor redemption island season 22 episode 11 tonight with a title of “Mystery Package” coz surely this will stir things up on the merge tribe murlonio. But in case you will the episode on your television set at home , just follow through the link here to watch survivor redemption island season 22 episode 11 a mystery package online for free at anyhotstuff.com\nHere’s some sort or recaps and tidbits for last week’s episode: 5. Rice Capades – I don’t really know where to begin with talking about Phillip this week. I know that I certainly don’t want to use the c-word to describe Phillip’s behavior. However, through all of the histrionics in this episode, one thing is clear: You can no longer make the argument that Phillip is playing a game with any sort of strategy.\nPhillip told us last week that his intention was to get Boston Rob to want Phillip next to him at the end of the game. However, at this point Phillip is not showing any signs that winning this game is his objective at all. Phillip is certainly entitled to having an opinion and feeling the way he does but part of being a good Survivor player is occasionally hiding your feelings in the interests of winning the game. Phillip’s aggressive behavior has all but assured himself a zero percent chance at the million dollars. Even if Phillip makes it to the final three, he would need five votes to win the game. Considering that there will likely be five Zapatera tribe members on the jury, this incident is going to stick to Phillip like a certain color on rice.\n4. The Great Divide – Besides for Phillip, I think the most unique thing about this season of Survivor is the lack of a merge. Oh, it technically happened, but this is the only season of Survivor I can remember where the merged tribe not only has a separate alliance but separate shelters and separate food rations too. Actually, this isn’t that uncommon, I know a lot of people in bad marriages who live the same way. The big question going forward will be how much will the Zapateras hold Boston Rob accountable for being shut out to this degree? Phillip has done a lot to take the heat off of Rob but don’t be surprised if at the end of the game, the Zapatera tribe continues to act as a group and completely vote together for whomever treated them best – which is why I maintain one of the three Ometepe women have a great shot to win this game.\n3. Saving Sheppard – This season, I have spent much more time breaking down Boston Rob’s decisions in the game than any of the other players. In my opinion, Rob has far more control in this game than any other Survivor may have had at this point in history. Since Rob is controlling the vote, did Rob make the right move by keeping Phillip this week? On the one hand, he realizes that getting rid of Phillip would end a lot of the drama around camp and may even create some goodwill among the remaining Zapateras. Instead, Rob chose to keep Phillip around for another week and I agree with his decision. Phillip Sheppard is the best thing that happened to Boston Rob this season because Phillip’s distractions keep everybody from thinking about the game. When Phillip is going off about rice, feathers or kung fu, nobody is ever asking themselves about their position in the tribe or some big move they’re going to make – and that’s exactly how Boston Rob wants it to be.\n2. Tribal Counseling – It was no surprise that the feud between Phillip and Steve spilled over in to this week’s tribal council. I thought that Jeff Probst showed why he is the best host on television by exploring both sides of the debate. What I still don’t understand is what happened to Phillip’s shirt? Has there ever been a Survivor contestant to attend tribal council topless before? Now with Julie gone the prospects seem pretty slim that Phillip will ever find his bathing suit. Phillip now can only hope to win a reward at some point to find the first clue to the hidden bathing suit.\n1. Three’s Company – This week we had our first ever three-way duel on Redemption Island, which ended in Mike and Matt moving on and David getting eliminated. I think the top 2 people advancing at Redemption Island seems like it would help Matt in his quest to return to the game since it seems unlikely he would ever come in last (unless the duel involved having a strategy of some sort). Unfortunately, it looks like Redemption Island is starting to really take its toll on Matt. In Matt’s prayers he says that he doesn’t want to be on Survivor anymore but is simply carrying out God’s will. You would think that having an extra person on Redemption Island might help cheer Matt up a little bit, but apparently Mike Chisel isn’t that great of a roommate.\nWhat you waiting for, watch Survivor: Redemption Island season 22 Episode 11 a Mystery Package Survivor: Redemption Tropical isle Year twenty-two Event 11: We all Can’t stand A lot of our Tribe is currently approaching globally regarding tv set landscape an important subject due to this usually are We all Dislike Much of our Tribe. So that it signifies usual account a single tribe has long been dislike other tribe the reason why? Inside the landscape with the Survivor: Redemption Tropical isle Month or year twenty-two Show 11 On line aboard just what occur inside this landscape. He together with Kristina duel at Redemption Island. On the Ometepe campy, tribe unity commences to help you out unravel. Thus test in order to savor Survivor: Redemption Tropical isle Length twenty-two Show 11 online. Survivor: Redemption Tropical area Period twenty-two Show 11:. Of which CBS Survivor: Redemption Tropical isle 22?11 show on tv alongside subject We all Can’t stand Many of our Tribe Survivor: Redemption Tropical isle Season twenty-two Event 11: EVERY Puzzle Deal. This particular CBS Survivor: Redemption Tropical isle 22?11 show on tv combined with subject ANY Puzzle Package deal shown about Saturday, Annual percentage rates 29 2011 for 08: 00 EVENING HOURS. This can be a new conclusion regarding Survivor: Redemption Tropical isle Year or so twenty-two Event 11: VIRTUALLY ANY Puzzle Deal: About Redemption Tropical isle, He will be having a mechanical disappointment, one more castaway will be voted through your video game. Previous shows: Episode 10 “Rice Wars” Phillip and also Steve clash. Episode 9 “The Colleague System” Rob tries to be able to secure an Ometepe connections, but Grant may really do the one to jeopardize the item. Survivor is an American version of this Survivor reality television sport show, itself derived from the Swedish television series Journey Robinson originally created in 1997 by Charlie Parsons. This series premiered on May perhaps 31, 2000 on CBS. It can be hosted by veteran television system personality, reporter and one-time performance show emcee Jeff Probst, who might be also an executive designer, and also executive that is caused by Mark Burnett and main creator Charlie Parsons. WATCH HERE : Watch Survivor: Redemption Island Season 22 Episode 11 The show maroons a small grouping strangers (as one or longer tribes) in a destitute locale, where they ought to provide food, water, open fire, and shelter for themselves, while competing in challenges to earn either a reward, or an immunity from expulsion from the game yearly of the successive votes for elimination. While a great deal rarer than elimination by vote, medical conditions, such as injury or infection, need eliminated several contestants. The last 2 or three survivors face a jury historically made from at least the final seven players voted shut off. That jury interrogates one last few, and then votes for those winner of the distinction of Sole Survivor in addition to a million dollar prize. The first U. S. season of Survivor followed identical general format as the particular Swedish series, but, subsequently, the show has introduced several twists over the core rules to keep the players on their toes and prevent players from influenced by strategies that succeeded with prior seasons. These alters have included tribal buttons, seasons starting with well over two tribes, the abil vity to exile a gamer from a tribe for a few days, and hidden immun ity idols that players are able to use to save themselves for tribal council. Season 22 It season’s cast features typically the return of Rob MICHAEL. and Russell. This is Russell’s third time for the show and Rob METERS. ‘s fourth. It is the very first time in the show’s hist ory that your cont estant has played several individual times. This per iod also feat ures two past NFL players (Grant and also Steve). CBS today annou nced 16 of 18 castaw ays who will compete against each additi onal on SURV IVOR: REDEMPTI ON TROPICAL ISLAND, when the Em my Award-win ning series returns as for the 22nd season, Wednesday, February. 16 (8: 00-9: 00 EVENING, ET/PT) on the CBS Video Network. Two of your 18 cas taways, to be reve aled later this 7-day period, are form er casta ways who will return to seek redemption. This edition of SURVI VOR will include a new twist when, for when, castaways who have been elimi nated th rough the ga me will have possibi lity to seek rede mption and re turn for the opport unity to win the mil lion mone tary prize. Each week at Tribal Coun cil beca use a cast away is vot ed from, they will be brou ght to an isola ted isl and gen erally known as “Rede mption Isla nd, ” where they ‘ll live alo ne in ex ile. To last on Redempt ion Isla nd, they must com pete in a duel about the next person elimin ated wit hin Tr ibal Cou ncil and pumped to the Island. The winner of each duel earns an appro priate to contin ue figh ting for ena ble you to retu rn to the game and the chance to compete for the subj ect of Sole Sur vivor; the part icular los er is sent hou se. The bat tle unfolds in Nica ragua where 18 casta ways will pos sibly be divi ded into two Trib es of nine: the Omet epe Tr ibe and then the Zapatera Tribe. The tr ibes are derived from indivi duals fro m all dif ferent bac kgrounds aid ed by the same ultimate goal: for being the Sole Survi vor. While 16 of yo ur cont estants are new to the competi tion, two are former castaways that will be gi ven an other opportu nity to com pete for the million dollar prize andf the other last shot at redem ption.\nAbout the Author\nWatch FULL EPISODE here for Free"}
{"url": "http://101squadron.com/blog/2007/05/pesky-peculiarities-of-css.html/comment-page-1", "timestamp": "2013-05-18T10:21:35", "dump": "CC-MAIN-2013-20", "segment": "1368696382261", "image_urls": [["http://101squadron.com/uploaded_images/Conger_89_cal-757679.jpg", null], ["http://101squadron.com/uploaded_images/Hammerin'-Hank-Conger-795118.jpg", null], ["http://101squadron.com/uploaded_images/hconger06108180bm-753187.jpg", null], ["http://101squadron.com/uploaded_images/HHMex8Au-794539.jpg", null], ["http://101squadron.com/uploaded_images/Conger-back-712123.jpg", null]], "text": "Pesky?\nthis was a high school project for a president campaign in our government class, yes thats him, for a school project, you guys are crazy\ni know his dad from work. very cool and funny guy!!"}
{"url": "http://1037theloon.com/tags/scorpions/", "timestamp": "2013-05-18T10:21:51", "dump": "CC-MAIN-2013-20", "segment": "1368696382261", "image_urls": [], "text": "metalkingdom.net [ 80′s @ 8 Feature Video – Big City Nights [VIDEO] By Chris Chapman March 13, 2012 It's time to rock out to those talented Germans Rudolf and Klaus from the Scorpions! \"Big City Nights\" wasn't as big as \"Rock You Like A Hurricane\" or \"Winds Of Change\", but it still stands the test of time. Read More Category: 80's @ 8 Featured Video Tags: 80's, big city nights, love at first sting, Scorpions Send to a friend! Print this page Share on Facebook Share on Twitter Pin it! Reddit This!"}
{"url": "http://1063thebuzz.com/category/reviews/page/7/", "timestamp": "2013-05-18T10:31:09", "dump": "CC-MAIN-2013-20", "segment": "1368696382261", "image_urls": [["https://s3.amazonaws.com/tsm-images/global/1x1.gif", "rotten-sound-cursed-large-promo-album-pic rotten-sound-cursed-large-promo-album-pic"], ["https://s3.amazonaws.com/tsm-images/global/1x1.gif", "rotten-sound-cursed-large-promo-album-pic rotten-sound-cursed-large-promo-album-pic"], ["https://s3.amazonaws.com/tsm-images/global/1x1.gif", "Twicebroken and Joshua David Twicebroken and Joshua David"], ["https://s3.amazonaws.com/tsm-images/global/1x1.gif", "splice dimension films"], ["https://s3.amazonaws.com/tsm-images/global/1x1.gif", "hqdefault24 hqdefault24"], ["https://s3.amazonaws.com/tsm-images/global/1x1.gif", "radioclown radioclown"], ["https://s3.amazonaws.com/tsm-images/global/1x1.gif", "hqdefault15 hqdefault15"], ["https://s3.amazonaws.com/tsm-images/global/1x1.gif", "Life On Kandahar Air Base Life On Kandahar Air Base"], ["https://s3.amazonaws.com/tsm-images/global/1x1.gif", "Havok-TimeIsUp-300x300 Havok-TimeIsUp-300x300"], ["https://s3.amazonaws.com/tsm-images/global/1x1.gif", "nightmare-300x244 freddy k"], ["https://s3.amazonaws.com/tsm-images/global/1x1.gif", "2011-dodge-charger-embed-4 2011-dodge-charger-embed-4"], ["https://s3.amazonaws.com/tsm-images/global/1x1.gif", "Mr Skin Mr Skin"], ["https://s3.amazonaws.com/tsm-images/global/1x1.gif", "hqdefault10 hqdefault10"]], "text": "Splice Review\nBlack Ops Escalation Map Pack [VIDEO]\nScream 4 Review-No Spoilers\nBest seem\nThrashman’s Metal Pick Of The Week\nNightmare On Elm Street [VIDEO]\n2011 Dodge Charger\nMr Skin’s Anatomy Awards"}
{"url": "http://1069therock.com/billy-gibbons-co-oh-well-song-review/", "timestamp": "2013-05-18T10:32:50", "dump": "CC-MAIN-2013-20", "segment": "1368696382261", "image_urls": [["http://wac.450f.edgecastcdn.net/80450F/ultimateclassicrock.com/files/2012/06/Fleetwood-Mac.jpg", "Just Tell Me That You Want Me Just Tell Me That You Want Me"], ["http://wac.450f.edgecastcdn.net/80450F/ultimateclassicrock.com/files/2012/06/8_out_102.png", "8_out_10"], ["http://s3.amazonaws.com/syndication-assets/ucr_syn_logo.png", "UltimateClassicRock.com UltimateClassicRock.com"]], "text": "Billy Gibbons & Co., ‘Oh Well’ – Song Review\nJust days after the announcement of a new Fleetwood Mac tribute album, fans can hear the first offering. ZZ Top‘s Billy Gibbons fronts a group that slows down and swampifies the 1969 hit ‘Oh Well.’\nNo one will accuse Gibbons, Matt Sweeney and Blake Mills of being intimidated by the already bluesy rock song. Their version is an original, born from the mud of Mississippi Delta.\nThis new power trio stretch a two or three minute cut (original version) to nearly five minutes of rootsy rambling with bare bones percussion and organ garnish. Gibbons is a burly behemoth on vocals, which don’t begin until almost 90 seconds into the song.\n‘s ‘Oh Well’ was one from his Texas twosome’s catalog. Sweeney has another cut on ‘Just Tell Me That You Want Me,’ available Aug. 14. This song makes you want to hear it immediately.\nListen to Billy Gibbons & Co., 'Oh Well'"}
{"url": "http://1075zoofm.com/silent-hill-revelation-3d-review/", "timestamp": "2013-05-18T10:40:29", "dump": "CC-MAIN-2013-20", "segment": "1368696382261", "image_urls": [["http://screencrush.com/files/2012/07/Silent-Hill-SC.jpg", "Silent Hill SC"]], "text": "‘Silent Hill: Revelation 3D’ Review\nAs far as sub-literate, incomprehensible pieces of garbage are concerned, ‘Silent Hill: Revelation 3D‘ is one of the year’s best.\nWith an asinine plot, risible dialogue and atrocious acting, this sequel to a half-remembered video game adaptation still manages to provide a great number of base thrills with its nightmarish imagery. As such it is a quagmire of dread both within and without, disturbing to watch and to think about. This makes for a strange alchemy: in time you identify with the lead character (a young woman in peril) not because you are engaged with the film, but because enduring such an atrocity becomes its own act of survival. How ’bout that for a neat trick, eh?\nWhich isn’t to say ‘Silent Hill: Revelation 3D’ isn’t gorgeous to look at. I have almost no recollection of the first film, other than a handful of striking images. That’s back again: the snow, walls of skin, faceless undead, buildings disintegrating into ash, contorted mannequins and an enormous bruiser with a metal pyramid over its head. Whether popping out of shadows for jump-scares or merely lined up in a tableaux, they are creepy and mysterious and get under your skin more so, frankly, than any other disturbing images in a mainstream horror film released this year.\nEven the “normal” scenes, the blue collar town and its mundane interiors, are saturated with bright, bold colors. There’s such a fine attention to the look (and sound, if your theater has nice speakers) it is shocking that the filmmakers would allow such truly wretched dialogue.\nIt’s just a few scenes in, when Sean Bean is having some sort of flashback with the previous film’s Radha Mitchell, where the belly laughs come. The words trip from their mouths like when little kids pretend at acting in a classical play. But in time you’ll put together that our lead, young Adelaide Clemens (playing 17 but, no offense, she could pass for 32) [Ed. note: she's 22] must not ever, ever, ever go to the mysterious town of Silent Hill. This is made abundantly clear. Yet when strange creatures begin following her, such as twitching, skinned, faceless creatures and, worse, Martin Donovan in a ruffled raincoat, loose tie and dirty hat, it’s only a matter of time before she hits the road.\nOstensibly she’s searching for her father (Bean) who is tied up in some ‘Flash Gordon’-ish chamber, but she’ll quickly discover that her visit will lead to an epic battle between good and evil, summoning a dormant spirit and…I dunno…there’s something to do with a giant coin that, when shoved into Malcolm McDowell’s chest does something to unleash….something. Even with Jon Snow from ‘Game of Thrones‘ hammering us with exposition in a really strange Canadian accent (though the film is set within a night’s drive of West Virginia,) I’m fairly certain that there is no one person out there that can explain the entirety of the baffling plot to ‘Silent Hill: Revelation 3D.’ I’m sure the video game purists will delight in all the boxes that need to be ticked before elevating to the next level; the rest of us will just wonder where the hell they’re running now.\nThe thing is that with better acting and a reevaluation of the script, you could almost take this movie seriously. Many of the scenes have a ‘Twin Peaks: Fire Walk With Me’ vibe, but whereas David Lynch will intentionally derail the narrative to evoke an uncomfortable response, ‘Silent Hill: Revelation 3D’ does it all au naturale. The overall disconnect (one minute an atmospheric ‘Carnival of Souls,’ the next minute unreleasable trash) is something that, I must confess, I enjoyed, but that is because I admire the occasional baffling moviegoing experience. Your mileage up this hill, as they say, may vary.\n‘Silent Hill: Revelation 3D’ is now playing in theaters.\nJordan Hoffman is a writer, critic and lapsed filmmaker living in New York City. His work can also be seen on Film.com, Badass Digest and StarTrek.com."}
{"url": "http://1079ishot.com/taylor-swift-justin-bieber-lady-gaga-forbes-highest-paid-under-30/", "timestamp": "2013-05-18T10:31:04", "dump": "CC-MAIN-2013-20", "segment": "1368696382261", "image_urls": [["http://wac.450f.edgecastcdn.net/80450F/popcrush.com/files/2012/07/SwiftBiebsGaga.jpg", "SwiftBiebsGaga SwiftBiebsGaga"]], "text": "Taylor Swift, Justin Bieber, Lady Gaga + More Are Forbes’ Highest Paid Under 30\n?\nSwift nabbed the numero uno slot since she earned a whopping $57 mil between May of this and last year. She can be counted on to sell about four million copies of her albums, in an age when albums don’t sell four million copies. She makes a cool milli per show, and with a CoverGirl contract, she’s golden like her curls.\nBiebs, a Forbes cover boy, tallied $55 million receipts. He’s a venture capitalist in the digital realm. RiRi — a former CoverGirl herself — raked in $53 million. Album sales, tours and promo gigs, with the deep pocket likes Vita Coco and Nivea skincare, earned her this slot.\nGaga fell from grace a bit. She plummeted to No. 4, after topping the list in 2011. She dropped from $90 million to $52 million. We know, $42 million seems like a big drop, but when the average Jane makes under $100,000, it’s hard to sympathize. The reason for the drop? Less touring in 2012, so expect an increase next year, since receipts from her Born This Way Ball, which is selling out, will count towards that list.\nPerry tallied $45 million from her music and touring. She won’t have to split it with ex-hubby Russell Brand, with whom she did not (!!!) have a pre-nup. That Russell is a stand up guy, and we’re not talking about his comedian gig.\nTop 10 Under 30:\n1. Taylor Swift\n2. Justin Bieber\n3. Rihanna\n4. Lady Gaga\n5. Katy Perry\n6. Adele\n7. Kristen Stewart\n8. Lil Wayne\n9. Taylor Lautner\n10. Robert Pattinson\nNext: See Justin Bieber's Celebrity Look-Alike\nWatch the B.o.B ‘Both of Us’ Video Feat. Taylor Swift"}
{"url": "http://1940.iwm.org.uk/?page_id=13", "timestamp": "2013-05-18T10:54:03", "dump": "CC-MAIN-2013-20", "segment": "1368696382261", "image_urls": [], "text": "All branches of the Imperial War Museum are commemorating the 70th anniversary of 1940 - the year which saw the introduction of rationing; Winston Churchill come to power; the evacuation of Dunkirk; the Battle of Britain; and the Blitz - with a range of special exhibitions, events and engaging online content.\nWhether you’d like to attend an air show at Imperial War Museum Duxford, want to review the new Explore History 1940 display at Imperial War Museum London, or are simply seeking background information on the momentous events of 1940, members of the press can find all relevant information on this page.\nPress releases\nFor information on any of the 1940 anniversary events or exhibitions taking place at the Imperial War Museum, please refer to one of the press releases below:\nThe Imperial War Museum Commemorates 1940, ‘Britain’s Finest Hour’\nImperial War Museum Duxford Commemorates the 70th Anniversary of the Battle of Britain\nDuxford in May: Battle of Britain Memorial Flight (Saturday 15 May) and Spring Air Show (Sunday 16 May)\nA Snapshot of Life at Duxford: Duxford in the Battle of Britain Photography Exhibition\nExplore History at Imperial War Museum London, from 21 May 2010\n1940s Activities at the Churchill War Rooms\nImages and Film\nA selection of high-resolution images, complete with captions and copyright information, is available to download from Pictures for Press.\nFor broadcast-quality film, get in touch directly with one of the Museum’s press offices who can provide a selection of archive and contemporary content on DVD.\nContacts\nIf you can’t find what you’re looking for above, please contact one of the Museum’s press offices:\nImperial War Museum London, Ellie Farrell: 020 7416 5497, efarrell@iwm.org.uk\nChurchill War Rooms and HMS Belfast, Nicola Osmond-Evans: 020 7416 5316, nosmond-evans@iwm.org.uk\nImperial War Museum Duxford, Esther Blaine: 01223 499 320, eblaine@iwm.org.uk\nImperial War Museum North, Alex Knight: 0161 836 4040, aknight@iwm.org.uk"}
{"url": "http://1heckofaguy.com/2011/10/16/leonard-cohens-do-i-have-to-dance-all-night-video-hits-30000-views/", "timestamp": "2013-05-18T10:13:18", "dump": "CC-MAIN-2013-20", "segment": "1368696382261", "image_urls": [], "text": "Yep – It’s Another Do I Have To Dance All Night Post\nSometime in the past 24 hours, the Heck Of A Guy-produced Do I Have To Dance All Night video1 passed 30,000 views (see above screenshot). (The Heck Of A Guy video of the 1980 version of Do I Have To Dance All Night has logged 9,663 views.)\nCue the festivities: Woo Hoo\nAfter all, 30,000 views on YouTube, a site where videos displaying cats performing cuteness beneath misspelled captions ring up millions of views isn’t much to email home about.\nIn fact, while an unbiased self-assessment may be intrinsically impossible, my best efforts in that spirit would hold that the personal significance of reaching this YouTube milestone breaks down to\n- Self-adulatory braggadocio – 20%\n- Rationalization for publishing yet another post about Do I Have To Dance All Night – 80%\nIndeed, spreading the awareness of Do I Have To Dance All Night, Leonard Cohen’s dandy, underappreciated song has become a moral imperative for this site.\nThe title of the first Heck Of A Guy post featuring this song (on July 6th, 2006) is revelatory: Do I Have To Dance All Night – The Best Leonard Cohen Song You’ve (Probably) Never Heard, I could then legitimately report\n… even someone who was a Big Leonard Cohen Fan probably hadn’t heard Do I Have To Dance All Night,2AKA The Best Leonard Cohen Song You’ve (Probably) Never Heard, unless he or she were\n1. A Big Leonard Cohen Fan who went to the right concerts in the late ’70s\nor\n2. A Big Leonard Cohen Fan who bought his or her 45s in Central Europe\nor\n3..2 Indeed, Do I Have To Dance All Night was and continues to be available only as a seven inch single that was originally recorded at a 1976 concert in Paris and pressed in Holland for sale in Central European countries.3\nAnd, I have repeatedly pointed out that this is a great, altogether wonderful Leonard Cohen.\nHeck Of A Guy hosts items about the semi-funky 1976 version of the song with Laura Branigan and the 1980 more gypsy, less disco rendition, videos constructed for both of these versions (1976 Do I Have To Dance All Night Video and 1980 Do I Have To Dance All Night Video), a groom singing Do I Have To Dance All Night at his wedding reception, a Christmas download of a MP3 of the song, and 30+ more.\nSo, 30,000 views of a song by a singer routinely said to have a cult following, a song that singer most recently performed over 30 years ago, a song that was only briefly released in 1976 as a 7 inch single in central Europe, a song that existed on the 2006 iteration of the internet in obscure bootlegs and as a single, hideously flawed MP3 in file-sharing systems … ain’t bad.\nThe crusade continues.\nLeonard Cohen – Do I Have To Dance All Night (1976 version)\n- Do I Have To Dance All Night is also the 1st Heck Of A Guy video; there are currently more than 4o such videos dealing with Leonard Cohen. [↩]\n- According to the Wikipedia, “Cohen wanted to include “Misty Blue”/”Do I Have to Dance All Night” as a free bonus single with the [Recent Songs] LP, but Columbia, his record company, rejected the idea.” [↩]\n- Do I Have To Dance All Night is Side A on the single; Side B features “The Butcher,” which is available on the Songs From a Room album. [↩]\nI agree, it is an addictive song. Very sexy. I wonder if LC ever hums it to himself?"}